[
    {
        "name": "Hello Languages",
        "link": "http://langs.bigsbyspot.org",
        "text": "Trying out and comparing multiple programming languages."
    },
    {
        "name": "Tic-Tac-Toe",
        "link": "http://tictactoe.bigsbyspot.org/",
        "text": "Implementing Tic-Tac-Toe Game in multiple platforms, runtimes and programing languages."
    },
    {
        "name": "Xamarin.Forms.OAuth",
        "link": "https://github.com/Bigsby/Xamarin.Forms.OAuth",
        "text": "A Nuget package that provides authentication for Xamarin Forms applications against a long list of OAuth Identity Providers."
    },
    {
        "name": "2048.net",
        "link": "https://github.com/Bigsby/2048.net",
        "text": "An implementation of 2048 game in Xamarin Forms that runs (almost) everywhere (Windows 10, Windows 10 IoT in Raspberry Pi, iOS, Android, Windows 10 Mobile)"
    },
    {
        "name": "NetCore",
        "link": "http://netcore.bigsbyspot.org",
        "text": "A tutorial on how to create .Net Core console and web applications from scratch in and that run on Windows (10), Linux (Debian) and Mac OS X (10.11 El Capitan)."
    },
    {
        "name": "Summing Matrices",
        "link": "http://matrix.bigsbyspot.org/",
        "text": "Solving an old mathematical problem in a computer program implemented in various programming languages."
    },
    {
        "name": "Website Boilerplate",
        "link": "http://boilerplate.bigsbyspot.org",
        "text": "An exploration on RequireJS, SystemJS, AngularJS, AngularUI Router, CodeMirror, highlight.js and Prism."
    },
    {
        "name": "Tower of Bab-IL",
        "link": "http://babil.bigsbyspot.org",
        "text": "A dive into the low-level .Net: programming languages, compilers, CIL, references, limitations and incompatibilities."
    },
    {
        "name": "Music Notation Standardization",
        "link": "https://www.w3.org/community/music-notation/participants",
        "text": "It took me sometime but I, finally, got to join the software developer and the \"musician\" sides of me and started participating in the creation of the all new music notation standards."
    },
    {
        "name": "Generic OData",
        "link": "https://github.com/Bigsby/schemaless-Odata",
        "text": "A generic and schemaless OData Web API controller."
    },
    {
        "name": "Generic Presenter",
        "link": "http://presenter.bigsbyspot.org",
        "text": "A web-based presenter that, through simple configuration, allows for slide-based presentations in two screens with notes."
    }
]